dependencies/OpenFOAM/modules/OpenQBMM/validation/explicitRhoFoam/PrandtlMeyerExpansion/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

nx -2.0;
x   2.0;
y   1.0;
theta 15.0;
ny  #calc "-tan(degToRad($theta))*$x";
depth 0.1;

vertices
(
    ($nx 0 0)
    (0 0 0)
    ($x $ny 0)
    ($x $y 0)
    (0 $y 0)
    ($nx $y 0)

    ($nx 0 $depth)
    (0 0 $depth)
    ($x $ny $depth)
    ($x $y $depth)
    (0 $y $depth)
    ($nx $y $depth)
);

blocks
(
    hex (0 1 4 5 6 7 10 11) (50 50 1) simpleGrading (1 1 1)
    hex (1 2 3 4 7 8 9 10) (50 50 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 5 11 6)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 3 9 8)
        );
    }
    top
    {
        type symmetryPlane;
        faces
        (
            (4 5 11 10)
            (3 4 10 9)
        );
    }
    obstacle
    {
        type wall;
        faces
        (
            (0 1 7 6)
            (1 2 8 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
