dependencies/OpenFOAM/modules/OpenQBMM/validation/explicitRhoFoam/PrandtlMeyerExpansion/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

compressible
{
    fluxScheme       HLLC;
}

ddtSchemes
{
    default          Euler;
    fluxIntegrator   RK45;
}

gradSchemes
{
    default         faceLimited leastSquares 1.0;
}

divSchemes
{
    default         none;
    div((thermo:mu*dev2(T(grad(U)))))   Gauss linear;
    div(massFlux,epsilon) bounded Gauss vanLeer;
    div(massFlux,k)      bounded Gauss vanLeer;
    div(massFlux,Ekp)    bounded Gauss vanLeer;

}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default             cubic;
    reconstruct(U)      MinmodV;
    reconstruct(H)      Minmod;
    reconstruct(p)      Minmod;
    reconstruct(rho)    Minmod;
    reconstruct(c)      Minmod;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
